bitwin/app/controllers/sessions_controller.rb

  def create
    user = User.find_by(nickname: params[:session][:nickname].downcase)
---
SELECT  "users".* FROM "users"  WHERE "users"."nickname" = 'pep' LIMIT 1