bitwin/app/controllers/users_controller.rb

  def show
    if loggedIn?
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 10]]

  def create
  	@user = User.new(user_params)
  	@user.coins = 0
  	if @user.save
---
INSERT INTO "users" ("coins", "created_at", "mail", "nickname", "password_digest", "updated_at", "walletNmb") VALUES (?, ?, ?, ?, ?, ?, ?)

 def destroy
    User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]