trunk/bitwin/app/controllers/gambles_controller.rb

  def index
    @user = User.find_by(id: params[:user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 3 LIMIT 1

  def new
      @user = User.find_by(id: params[:user_id])
      @gambleAll = Gamble.all
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 3 LIMIT 1
SELECT "gambles".* FROM "gambles"   ORDER BY created_at DESC

  def create
    @user = User.find_by(id: params[:user_id])
    price = 15
    @gambleAll = Gamble.all
    if @user.coins >= price
      @gamble = @user.gambles.create(gamble_params)
      @gamble.cost = 0
      raffledNumbers = generateRaffledNumbers
      @gamble.firstRaffled = raffledNumbers[0]
      @gamble.secondRaffled = raffledNumbers[1]
      @gamble.thirdRaffled = raffledNumbers[2]
      @gamble.fourthRaffled = raffledNumbers[3]
      @gamble.fifthRaffled = raffledNumbers[4]
      @gamble.profit = calculateProfit(@gamble)
      if @gamble.save
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 3 LIMIT 1
INSERT INTO "gambles" ("cost", "created_at", "fifthChosen", "fifthRaffled", "firstChosen", "firstRaffled", "fourthChosen", "fourthRaffled", "profit", "secondChosen", "secondRaffled", "thirdChosen", "thirdRaffled", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "coins" = ?, "updated_at" = ? WHERE "users"."id" = 3  [["coins", 35], ["updated_at", "2014-12-01 03:50:06.230648"]]

  def show
    @user = User.find(params[:user_id])
    @gamble = @user.gambles.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2 LIMIT 1
SELECT  "gambles".* FROM "gambles"  WHERE "gambles"."user_id" = ? AND "gambles"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["user_id", 3], ["id", 2]]