trunk/bitwin/app/controllers/shoppings_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 3 LIMIT 1
---
	def index
		@user = User.find_by(id: params[:user_id])

SELECT  "users".* FROM "users"  WHERE "users"."id" = 3 LIMIT 1
---
 	def new
     	@user = User.find_by(id: params[:user_id])

SELECT  "users".* FROM "users"  WHERE "users"."id" = 3 LIMIT 1
INSERT INTO "shoppings" ("amount", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["amount", 15], ["created_at", "2014-11-30 23:44:20.863405"], ["updated_at", "2014-11-30 23:44:20.863405"], ["user_id", 3]]
UPDATE "users" SET "coins" = ?, "updated_at" = ? WHERE "users"."id" = 3  [["coins", 15], ["updated_at", "2014-11-30 23:44:21.081997"]]
---
  def create
  	@user = User.find_by(id: params[:user_id])
   	@shopping = @user.shoppings.create(shopping_params)
   	if @shopping.save