trunk/bitwin/app/controllers/users_controller.rb

INSERT INTO "users" ("coins", "created_at", "mail", "nickname", "password_digest", "updated_at", "walletNmb") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@user = User.new(user_params)
  	@user.coins = 0
  	if @user.save